IDEA Open Model
ConcreteULSCheckResultShearEc2 Properties
Compatible with IDEA StatiCa Beta 20.0
The ConcreteULSCheckResultShearEc2 type exposes the following members.
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Ved
 shear force
Vrd
 decisive shear resistance
Vrdc
 shear resistance of concrete
Vrdmax
 shear resistance of compression strut
Vrdr
 shear resistance
Vrds
 shear resistance of shear reinforcement
Top
See Also
Reference
ConcreteULSCheckResultShearEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace